In [1]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [2]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [3]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [4]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [5]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [6]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)

In [7]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [8]:
df.to_csv("wine.csv")

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       178 non-null    int64
 1   1       178 non-null    float64
 2   2       178 non-null    float64
 3   3       178 non-null    float64
 4   4       178 non-null    float64
 5   5       178 non-null    int64
 6   6       178 non-null    float64
 7   7       178 non-null    float64
 8   8       178 non-null    float64
 9   9       178 non-null    float64
 10  10      178 non-null    float64
 11  11      178 non-null    float64
 12  12      178 non-null    float64
 13  13      178 non-null    int64
dtypes: float64(11), int64(3)
memory usage: 19.6 KB

In [10]:
df.count()

0     178
1     178
2     178
3     178
4     178
5     178
6     178
7     178
8     178
9     178
10    178
11    178
12    178
13    178
dtype: int64

In [11]:
!pip install lxml
!pip install html5lib
!pip install beautifulsoup4

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: lxml in c:\users\hp\appdata\roaming\python\python311\site-packages (6.0.2)

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: html5lib in c:\users\hp\appdata\roaming\python\python311\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\hp\appdata\roaming\python\python311\site-packages (from html5lib) (1.17.0)
Requirement already satisfied: webencodings in c:\program files\python311\lib\site-packages (from html5lib) (0.5.1)

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: beautifulsoup4 in c:\program files\python311\lib\site-packages (4.14.3)
Requirement already satisfied: soupsieve>=1.6.1 in c:\program files\python311\lib\site-packages (from beautifulsoup4) (2.8.1)
Requirement already satisfied: typing-extensions>=4.0.0 in c:\users\hp\appdata\roaming\python\python311\site-packages (from beautifulsoup4) (4.15.0)

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [55]:

url="https://www.fdic.gov/bank-failures/failed-bank-list/"

df=pd.read_html(url)

In [56]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Metropolitan Capital Bank & Trust,Chicago,Illinois,57488,First Independence Bank,"January 30, 2026",10550
1,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
2,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
3,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
4,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
5,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
6,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
7,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
8,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
9,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
10,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
11,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
12,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
13,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
14,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
15,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
16,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
17,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
18,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
19,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
20,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
21,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
22,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
23,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
24,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524

In [57]:
all_data = []

for page in range(1, 24):   # 1 to 23
    url = f"https://www.fdic.gov/bank-failures/failed-bank-list?pg={page}"
    
    print("Scraping page:", page)

    df_page = pd.read_html(url)
    all_data.append(df_page[0])  # Append the first table from each page

# সব page merge করে একটা DataFrame
final_df = pd.concat(all_data, ignore_index=True)

print("Total records:", len(final_df))
final_df.head()

Scraping page: 1
Scraping page: 2
Scraping page: 3
Scraping page: 4
Scraping page: 5
Scraping page: 6
Scraping page: 7
Scraping page: 8
Scraping page: 9
Scraping page: 10
Scraping page: 11
Scraping page: 12
Scraping page: 13
Scraping page: 14
Scraping page: 15
Scraping page: 16
Scraping page: 17
Scraping page: 18
Scraping page: 19
Scraping page: 20
Scraping page: 21
Scraping page: 22
Scraping page: 23
Total records: 573

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Metropolitan Capital Bank & Trust,Chicago,Illinois,57488,First Independence Bank,"January 30, 2026",10550
1,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
2,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
3,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
4,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546

In [59]:
final_df.to_csv("Banks.csv", index=False)

In [ ]:
final_df.to_excel("Banks.xlsx", index=False)

In [61]:
final_df

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,Metropolitan Capital Bank & Trust,Chicago,Illinois,57488,First Independence Bank,"January 30, 2026",10550
1,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
2,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
3,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
4,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
...,...,...,...,...,...,...,...
568,Sinclair National Bank,Gravette,Arkansas,34248,Delta Trust & Bank,"September 7, 2001",4649
569,Malta National Bank,Malta,Ohio,6629,North Valley Bank,"May 3, 2001",4648
570,First Alliance Bank & Trust Co.,Manchester,New Hampshire,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
571,The National State Bank of Metropolis,Metropolis,Illinois,3815,Banterra Bank of Marion,"December 14, 2000",4646
572,Bank of Honolulu,Honolulu,Hawaii,21029,Bank of the Orient,"October 13, 2000",4645

In [16]:
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\hp\appdata\roaming\python\python311\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\hp\appdata\roaming\python\python311\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [66]:
df=pd.read_excel("index.xlsx",sheet_name="Sheet3",header=1,)

In [67]:
df

   Unnamed: 0  Product ID  Product Name HS Code  Seller Name  Qty Sold
0         NaN         101      HardDisk  AP0101  Ram Traders        23
1         NaN         102    Microphone  AP0102      Rajesh         20
2         NaN         103  Mobile Stand  AP0103       Shivam        30
3         NaN         104  Laptop Stand  AP0104        Sethi        40
4         NaN         105    Mic Holder  AP0105        Rahul        34
5         NaN         106       Printer  AP0106         Aman        54
6         NaN         107       Scanner  AP0107        Sohan        30
7         NaN         108       Monitor  AP0108       Chandu        10
8         NaN         109         Mouse  AP0109        Rohan        20
9         NaN         110      Keyboard  AP0110         Sonu        25

In [68]:
df = df.drop(columns=["Unnamed: 0"])
df.head()

   Product ID  Product Name HS Code  Seller Name  Qty Sold
0         101      HardDisk  AP0101  Ram Traders        23
1         102    Microphone  AP0102      Rajesh         20
2         103  Mobile Stand  AP0103       Shivam        30
3         104  Laptop Stand  AP0104        Sethi        40
4         105    Mic Holder  AP0105        Rahul        34

In [3]:
import pandas as pd
df=pd.read_csv("Hospital.csv")
df.head()

,Patient Id,Patient Admission Date,Patient First Inital,Patient Last Name,Patient Gender,Patient Age,Patient Race,Department Referral,Patient Admission Flag,Patient Satisfaction Score,Patient Waittime,Patient Admission Flag.1
0,145-39-5406,20-03-2024 08:47,H,Glasspool,M,69,White,NaN,False,10.0,39,False
1,316-34-3057,15-06-2024 11:29,X,Methuen,M,4,Native American/Alaska Native,NaN,True,NaN,27,True
2,897-46-3852,20-06-2024 09:13,P,Schubuser,F,56,African American,General Practice,True,9.0,55,True
3,358-31-9711,04-02-2024 22:34,U,Titcombe,F,24,Native American/Alaska Native,General Practice,True,8.0,31,True
4,289-26-0537,04-09-2024 17:48,Y,Gionettitti,Male,5,African American,Orthopedics,False,NaN,10,False

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9216 entries, 0 to 9215
Data columns (total 12 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Patient Id                  9216 non-null   object
 1   Patient Admission Date      9216 non-null   object
 2   Patient First Inital        9216 non-null   object
 3   Patient Last Name           9216 non-null   object
 4   Patient Gender              9216 non-null   object
 5   Patient Age                 9216 non-null   int64
 6   Patient Race                9216 non-null   object
 7   Department Referral         3816 non-null   object
 8   Patient Admission Flag      9216 non-null   bool
 9   Patient Satisfaction Score  2517 non-null   float64
 10  Patient Waittime            9216 non-null   int64
 11  Patient Admission Flag.1    9216 non-null   bool
dtypes: bool(2), float64(1), int64(2), object(7)
memory usage: 738.1+ KB

In [9]:
df=df.rename(columns={"Patient Admission Date":"Date"})
df.head()

,Patient Id,Date,Patient First Inital,Patient Last Name,Patient Gender,Patient Age,Patient Race,Department Referral,Patient Admission Flag,Patient Satisfaction Score,Patient Waittime
0,145-39-5406,20-03-2024 08:47,H,Glasspool,M,69,White,NaN,False,10.0,39
1,316-34-3057,15-06-2024 11:29,X,Methuen,M,4,Native American/Alaska Native,NaN,True,NaN,27
2,897-46-3852,20-06-2024 09:13,P,Schubuser,F,56,African American,General Practice,True,9.0,55
3,358-31-9711,04-02-2024 22:34,U,Titcombe,F,24,Native American/Alaska Native,General Practice,True,8.0,31
4,289-26-0537,04-09-2024 17:48,Y,Gionettitti,Male,5,African American,Orthopedics,False,NaN,10

In [10]:
df.columns

Index(['Patient Id', 'Date', 'Patient First Inital', 'Patient Last Name',
       'Patient Gender', 'Patient Age', 'Patient Race', 'Department Referral',
       'Patient Admission Flag', 'Patient Satisfaction Score',
       'Patient Waittime'],
      dtype='object')

In [ ]:
df.drop(columns=["Patient Admission Flag.1"], inplace=True)

In [11]:
df.head()

,Patient Id,Date,Patient First Inital,Patient Last Name,Patient Gender,Patient Age,Patient Race,Department Referral,Patient Admission Flag,Patient Satisfaction Score,Patient Waittime
0,145-39-5406,20-03-2024 08:47,H,Glasspool,M,69,White,NaN,False,10.0,39
1,316-34-3057,15-06-2024 11:29,X,Methuen,M,4,Native American/Alaska Native,NaN,True,NaN,27
2,897-46-3852,20-06-2024 09:13,P,Schubuser,F,56,African American,General Practice,True,9.0,55
3,358-31-9711,04-02-2024 22:34,U,Titcombe,F,24,Native American/Alaska Native,General Practice,True,8.0,31
4,289-26-0537,04-09-2024 17:48,Y,Gionettitti,Male,5,African American,Orthopedics,False,NaN,10

In [12]:
df.isnull().sum()

Patient Id                       0
Date                             0
Patient First Inital             0
Patient Last Name                0
Patient Gender                   0
Patient Age                      0
Patient Race                     0
Department Referral           5400
Patient Admission Flag           0
Patient Satisfaction Score    6699
Patient Waittime                 0
dtype: int64

In [13]:
df.count()

Patient Id                    9216
Date                          9216
Patient First Inital          9216
Patient Last Name             9216
Patient Gender                9216
Patient Age                   9216
Patient Race                  9216
Department Referral           3816
Patient Admission Flag        9216
Patient Satisfaction Score    2517
Patient Waittime              9216
dtype: int64

In [15]:
df["Patient First Inital"]=df["Patient First Inital"]+"."+df["Patient Last Name"]
df.head()

,Patient Id,Date,Patient First Inital,Patient Last Name,Patient Gender,Patient Age,Patient Race,Department Referral,Patient Admission Flag,Patient Satisfaction Score,Patient Waittime,Patient Name
0,145-39-5406,20-03-2024 08:47,H.Glasspool,Glasspool,M,69,White,NaN,False,10.0,39,H.Glasspool
1,316-34-3057,15-06-2024 11:29,X.Methuen,Methuen,M,4,Native American/Alaska Native,NaN,True,NaN,27,X.Methuen
2,897-46-3852,20-06-2024 09:13,P.Schubuser,Schubuser,F,56,African American,General Practice,True,9.0,55,P.Schubuser
3,358-31-9711,04-02-2024 22:34,U.Titcombe,Titcombe,F,24,Native American/Alaska Native,General Practice,True,8.0,31,U.Titcombe
4,289-26-0537,04-09-2024 17:48,Y.Gionettitti,Gionettitti,Male,5,African American,Orthopedics,False,NaN,10,Y.Gionettitti

In [17]:
df.drop(columns=["Patient Last Name", "Patient Name"], axis=1, inplace=True)

In [18]:
df.head()

,Patient Id,Date,Patient First Inital,Patient Gender,Patient Age,Patient Race,Department Referral,Patient Admission Flag,Patient Satisfaction Score,Patient Waittime
0,145-39-5406,20-03-2024 08:47,H.Glasspool,M,69,White,NaN,False,10.0,39
1,316-34-3057,15-06-2024 11:29,X.Methuen,M,4,Native American/Alaska Native,NaN,True,NaN,27
2,897-46-3852,20-06-2024 09:13,P.Schubuser,F,56,African American,General Practice,True,9.0,55
3,358-31-9711,04-02-2024 22:34,U.Titcombe,F,24,Native American/Alaska Native,General Practice,True,8.0,31
4,289-26-0537,04-09-2024 17:48,Y.Gionettitti,Male,5,African American,Orthopedics,False,NaN,10

In [20]:
df["Patient Satisfaction Score"]=df["Patient Satisfaction Score"].fillna(df["Patient Satisfaction Score"].mean())

In [29]:
df["Department Referral"].unique()

array([nan, 'General Practice', 'Orthopedics', 'Gastroenterology',
       'Physiotherapy', 'Neurology', 'Cardiology', 'Renal'], dtype=object)

In [31]:
df["Department Referral"].value_counts(dropna=False)

Department Referral
NaN                 5400
General Practice    1840
Orthopedics          995
Physiotherapy        276
Cardiology           248
Neurology            193
Gastroenterology     178
Renal                 86
Name: count, dtype: int64

In [27]:
df.groupby("Department Referral")["Patient Satisfaction Score"].mean()

Department Referral
Cardiology          5.034651
Gastroenterology    5.236038
General Practice    5.011074
Neurology           5.071956
Orthopedics         4.953164
Physiotherapy       4.990820
Renal               4.877900
Name: Patient Satisfaction Score, dtype: float64